MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz2051ca9/thirdparty/pic32cz2051ca9/component/eth.h
/* -------- ETH_NCFGR : (ETH Offset: 0x1004) (R/W 32) Network Configuration Register -------- */
#define ETH_NCFGR_RESETVALUE                  _UINT32_(0x80000)                                    /*  (ETH_NCFGR) Network Configuration Register  Reset Value */

#define ETH_NCFGR_SPD_Pos                     _UINT32_(0)                                          /* (ETH_NCFGR) Speed Position */
#define ETH_NCFGR_SPD_Msk                     (_UINT32_(0x1) << ETH_NCFGR_SPD_Pos)                 /* (ETH_NCFGR) Speed Mask */
#define ETH_NCFGR_SPD(value)                  (ETH_NCFGR_SPD_Msk & (_UINT32_(value) << ETH_NCFGR_SPD_Pos)) /* Assignment of value for SPD in the ETH_NCFGR register */
#define ETH_NCFGR_FD_Pos                      _UINT32_(1)                                          /* (ETH_NCFGR) Full Duplex Position */
#define ETH_NCFGR_FD_Msk                      (_UINT32_(0x1) << ETH_NCFGR_FD_Pos)                  /* (ETH_NCFGR) Full Duplex Mask */
#define ETH_NCFGR_FD(value)                   (ETH_NCFGR_FD_Msk & (_UINT32_(value) << ETH_NCFGR_FD_Pos)) /* Assignment of value for FD in the ETH_NCFGR register */
#define ETH_NCFGR_DNVLAN_Pos                  _UINT32_(2)                                          /* (ETH_NCFGR) Discard Non-VLAN FRAMES Position */
#define ETH_NCFGR_DNVLAN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_DNVLAN_Pos)              /* (ETH_NCFGR) Discard Non-VLAN FRAMES Mask */
#define ETH_NCFGR_DNVLAN(value)               (ETH_NCFGR_DNVLAN_Msk & (_UINT32_(value) << ETH_NCFGR_DNVLAN_Pos)) /* Assignment of value for DNVLAN in the ETH_NCFGR register */
#define ETH_NCFGR_JFRAME_Pos                  _UINT32_(3)                                          /* (ETH_NCFGR) Jumbo Frame Size Position */
#define ETH_NCFGR_JFRAME_Msk                  (_UINT32_(0x1) << ETH_NCFGR_JFRAME_Pos)              /* (ETH_NCFGR) Jumbo Frame Size Mask */
#define ETH_NCFGR_JFRAME(value)               (ETH_NCFGR_JFRAME_Msk & (_UINT32_(value) << ETH_NCFGR_JFRAME_Pos)) /* Assignment of value for JFRAME in the ETH_NCFGR register */
#define ETH_NCFGR_CAF_Pos                     _UINT32_(4)                                          /* (ETH_NCFGR) Copy All Frames Position */
#define ETH_NCFGR_CAF_Msk                     (_UINT32_(0x1) << ETH_NCFGR_CAF_Pos)                 /* (ETH_NCFGR) Copy All Frames Mask */
#define ETH_NCFGR_CAF(value)                  (ETH_NCFGR_CAF_Msk & (_UINT32_(value) << ETH_NCFGR_CAF_Pos)) /* Assignment of value for CAF in the ETH_NCFGR register */
#define ETH_NCFGR_NBC_Pos                     _UINT32_(5)                                          /* (ETH_NCFGR) No Broadcast Position */
#define ETH_NCFGR_NBC_Msk                     (_UINT32_(0x1) << ETH_NCFGR_NBC_Pos)                 /* (ETH_NCFGR) No Broadcast Mask */
#define ETH_NCFGR_NBC(value)                  (ETH_NCFGR_NBC_Msk & (_UINT32_(value) << ETH_NCFGR_NBC_Pos)) /* Assignment of value for NBC in the ETH_NCFGR register */
#define ETH_NCFGR_MTIHEN_Pos                  _UINT32_(6)                                          /* (ETH_NCFGR) Multicast Hash Enable Position */
#define ETH_NCFGR_MTIHEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_MTIHEN_Pos)              /* (ETH_NCFGR) Multicast Hash Enable Mask */
#define ETH_NCFGR_MTIHEN(value)               (ETH_NCFGR_MTIHEN_Msk & (_UINT32_(value) << ETH_NCFGR_MTIHEN_Pos)) /* Assignment of value for MTIHEN in the ETH_NCFGR register */
#define ETH_NCFGR_UNIHEN_Pos                  _UINT32_(7)                                          /* (ETH_NCFGR) Unicast Hash Enable Position */
#define ETH_NCFGR_UNIHEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_UNIHEN_Pos)              /* (ETH_NCFGR) Unicast Hash Enable Mask */
#define ETH_NCFGR_UNIHEN(value)               (ETH_NCFGR_UNIHEN_Msk & (_UINT32_(value) << ETH_NCFGR_UNIHEN_Pos)) /* Assignment of value for UNIHEN in the ETH_NCFGR register */
#define ETH_NCFGR_MAXFS_Pos                   _UINT32_(8)                                          /* (ETH_NCFGR) 1536 Maximum Frame Size Position */
#define ETH_NCFGR_MAXFS_Msk                   (_UINT32_(0x1) << ETH_NCFGR_MAXFS_Pos)               /* (ETH_NCFGR) 1536 Maximum Frame Size Mask */
#define ETH_NCFGR_MAXFS(value)                (ETH_NCFGR_MAXFS_Msk & (_UINT32_(value) << ETH_NCFGR_MAXFS_Pos)) /* Assignment of value for MAXFS in the ETH_NCFGR register */
#define ETH_NCFGR_EXTADDMT_Pos                _UINT32_(9)                                          /* (ETH_NCFGR) External Address Match Enable Position */
#define ETH_NCFGR_EXTADDMT_Msk                (_UINT32_(0x1) << ETH_NCFGR_EXTADDMT_Pos)            /* (ETH_NCFGR) External Address Match Enable Mask */
#define ETH_NCFGR_EXTADDMT(value)             (ETH_NCFGR_EXTADDMT_Msk & (_UINT32_(value) << ETH_NCFGR_EXTADDMT_Pos)) /* Assignment of value for EXTADDMT in the ETH_NCFGR register */
#define ETH_NCFGR_GIGE_Pos                    _UINT32_(10)                                         /* (ETH_NCFGR) Gigabit mode Enable Position */
#define ETH_NCFGR_GIGE_Msk                    (_UINT32_(0x1) << ETH_NCFGR_GIGE_Pos)                /* (ETH_NCFGR) Gigabit mode Enable Mask */
#define ETH_NCFGR_GIGE(value)                 (ETH_NCFGR_GIGE_Msk & (_UINT32_(value) << ETH_NCFGR_GIGE_Pos)) /* Assignment of value for GIGE in the ETH_NCFGR register */
#define ETH_NCFGR_PCSSEL_Pos                  _UINT32_(11)                                         /* (ETH_NCFGR) PCS Select Position */
#define ETH_NCFGR_PCSSEL_Msk                  (_UINT32_(0x1) << ETH_NCFGR_PCSSEL_Pos)              /* (ETH_NCFGR) PCS Select Mask */
#define ETH_NCFGR_PCSSEL(value)               (ETH_NCFGR_PCSSEL_Msk & (_UINT32_(value) << ETH_NCFGR_PCSSEL_Pos)) /* Assignment of value for PCSSEL in the ETH_NCFGR register */
#define ETH_NCFGR_RTY_Pos                     _UINT32_(12)                                         /* (ETH_NCFGR) Retry Test Position */
#define ETH_NCFGR_RTY_Msk                     (_UINT32_(0x1) << ETH_NCFGR_RTY_Pos)                 /* (ETH_NCFGR) Retry Test Mask */
#define ETH_NCFGR_RTY(value)                  (ETH_NCFGR_RTY_Msk & (_UINT32_(value) << ETH_NCFGR_RTY_Pos)) /* Assignment of value for RTY in the ETH_NCFGR register */
#define ETH_NCFGR_PEN_Pos                     _UINT32_(13)                                         /* (ETH_NCFGR) Pause Enable Position */
#define ETH_NCFGR_PEN_Msk                     (_UINT32_(0x1) << ETH_NCFGR_PEN_Pos)                 /* (ETH_NCFGR) Pause Enable Mask */
#define ETH_NCFGR_PEN(value)                  (ETH_NCFGR_PEN_Msk & (_UINT32_(value) << ETH_NCFGR_PEN_Pos)) /* Assignment of value for PEN in the ETH_NCFGR register */
#define ETH_NCFGR_RXBUFO_Pos                  _UINT32_(14)                                         /* (ETH_NCFGR) Receive Buffer Offset Position */
#define ETH_NCFGR_RXBUFO_Msk                  (_UINT32_(0x3) << ETH_NCFGR_RXBUFO_Pos)              /* (ETH_NCFGR) Receive Buffer Offset Mask */
#define ETH_NCFGR_RXBUFO(value)               (ETH_NCFGR_RXBUFO_Msk & (_UINT32_(value) << ETH_NCFGR_RXBUFO_Pos)) /* Assignment of value for RXBUFO in the ETH_NCFGR register */
#define ETH_NCFGR_LFERD_Pos                   _UINT32_(16)                                         /* (ETH_NCFGR) Length Field Error Frame Discard Position */
#define ETH_NCFGR_LFERD_Msk                   (_UINT32_(0x1) << ETH_NCFGR_LFERD_Pos)               /* (ETH_NCFGR) Length Field Error Frame Discard Mask */
#define ETH_NCFGR_LFERD(value)                (ETH_NCFGR_LFERD_Msk & (_UINT32_(value) << ETH_NCFGR_LFERD_Pos)) /* Assignment of value for LFERD in the ETH_NCFGR register */
#define ETH_NCFGR_RFCS_Pos                    _UINT32_(17)                                         /* (ETH_NCFGR) Remove FCS Position */
#define ETH_NCFGR_RFCS_Msk                    (_UINT32_(0x1) << ETH_NCFGR_RFCS_Pos)                /* (ETH_NCFGR) Remove FCS Mask */
#define ETH_NCFGR_RFCS(value)                 (ETH_NCFGR_RFCS_Msk & (_UINT32_(value) << ETH_NCFGR_RFCS_Pos)) /* Assignment of value for RFCS in the ETH_NCFGR register */
#define ETH_NCFGR_CLK_Pos                     _UINT32_(18)                                         /* (ETH_NCFGR) MDC CLock Division Position */
#define ETH_NCFGR_CLK_Msk                     (_UINT32_(0x7) << ETH_NCFGR_CLK_Pos)                 /* (ETH_NCFGR) MDC CLock Division Mask */
#define ETH_NCFGR_CLK(value)                  (ETH_NCFGR_CLK_Msk & (_UINT32_(value) << ETH_NCFGR_CLK_Pos)) /* Assignment of value for CLK in the ETH_NCFGR register */
#define ETH_NCFGR_DBW_Pos                     _UINT32_(21)                                         /* (ETH_NCFGR) Data Bus Width Position */
#define ETH_NCFGR_DBW_Msk                     (_UINT32_(0x3) << ETH_NCFGR_DBW_Pos)                 /* (ETH_NCFGR) Data Bus Width Mask */
#define ETH_NCFGR_DBW(value)                  (ETH_NCFGR_DBW_Msk & (_UINT32_(value) << ETH_NCFGR_DBW_Pos)) /* Assignment of value for DBW in the ETH_NCFGR register */
#define ETH_NCFGR_DCPF_Pos                    _UINT32_(23)                                         /* (ETH_NCFGR) Disable Copy of Pause Frames Position */
#define ETH_NCFGR_DCPF_Msk                    (_UINT32_(0x1) << ETH_NCFGR_DCPF_Pos)                /* (ETH_NCFGR) Disable Copy of Pause Frames Mask */
#define ETH_NCFGR_DCPF(value)                 (ETH_NCFGR_DCPF_Msk & (_UINT32_(value) << ETH_NCFGR_DCPF_Pos)) /* Assignment of value for DCPF in the ETH_NCFGR register */
#define ETH_NCFGR_RXCOEN_Pos                  _UINT32_(24)                                         /* (ETH_NCFGR) Receive Checksum Offload Enable Position */
#define ETH_NCFGR_RXCOEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_RXCOEN_Pos)              /* (ETH_NCFGR) Receive Checksum Offload Enable Mask */
#define ETH_NCFGR_RXCOEN(value)               (ETH_NCFGR_RXCOEN_Msk & (_UINT32_(value) << ETH_NCFGR_RXCOEN_Pos)) /* Assignment of value for RXCOEN in the ETH_NCFGR register */
#define ETH_NCFGR_EFRHD_Pos                   _UINT32_(25)                                         /* (ETH_NCFGR) Enable Frames Received in Half Duplex Position */
#define ETH_NCFGR_EFRHD_Msk                   (_UINT32_(0x1) << ETH_NCFGR_EFRHD_Pos)               /* (ETH_NCFGR) Enable Frames Received in Half Duplex Mask */
#define ETH_NCFGR_EFRHD(value)                (ETH_NCFGR_EFRHD_Msk & (_UINT32_(value) << ETH_NCFGR_EFRHD_Pos)) /* Assignment of value for EFRHD in the ETH_NCFGR register */
#define ETH_NCFGR_IRXFCS_Pos                  _UINT32_(26)                                         /* (ETH_NCFGR) Ignore RX FCS Position */
#define ETH_NCFGR_IRXFCS_Msk                  (_UINT32_(0x1) << ETH_NCFGR_IRXFCS_Pos)              /* (ETH_NCFGR) Ignore RX FCS Mask */
#define ETH_NCFGR_IRXFCS(value)               (ETH_NCFGR_IRXFCS_Msk & (_UINT32_(value) << ETH_NCFGR_IRXFCS_Pos)) /* Assignment of value for IRXFCS in the ETH_NCFGR register */
#define ETH_NCFGR_SGMII_Pos                   _UINT32_(27)                                         /* (ETH_NCFGR) SGMII Mode Enable Position */
#define ETH_NCFGR_SGMII_Msk                   (_UINT32_(0x1) << ETH_NCFGR_SGMII_Pos)               /* (ETH_NCFGR) SGMII Mode Enable Mask */
#define ETH_NCFGR_SGMII(value)                (ETH_NCFGR_SGMII_Msk & (_UINT32_(value) << ETH_NCFGR_SGMII_Pos)) /* Assignment of value for SGMII in the ETH_NCFGR register */
#define ETH_NCFGR_IPGSEN_Pos                  _UINT32_(28)                                         /* (ETH_NCFGR) IP Stretch Enable Position */
#define ETH_NCFGR_IPGSEN_Msk                  (_UINT32_(0x1) << ETH_NCFGR_IPGSEN_Pos)              /* (ETH_NCFGR) IP Stretch Enable Mask */
#define ETH_NCFGR_IPGSEN(value)               (ETH_NCFGR_IPGSEN_Msk & (_UINT32_(value) << ETH_NCFGR_IPGSEN_Pos)) /* Assignment of value for IPGSEN in the ETH_NCFGR register */
#define ETH_NCFGR_RXBP_Pos                    _UINT32_(29)                                         /* (ETH_NCFGR) Receive Bad Preamble Position */
#define ETH_NCFGR_RXBP_Msk                    (_UINT32_(0x1) << ETH_NCFGR_RXBP_Pos)                /* (ETH_NCFGR) Receive Bad Preamble Mask */
#define ETH_NCFGR_RXBP(value)                 (ETH_NCFGR_RXBP_Msk & (_UINT32_(value) << ETH_NCFGR_RXBP_Pos)) /* Assignment of value for RXBP in the ETH_NCFGR register */
#define ETH_NCFGR_IRXER_Pos                   _UINT32_(30)                                         /* (ETH_NCFGR) Ignore IPG GRXER Position */
#define ETH_NCFGR_IRXER_Msk                   (_UINT32_(0x1) << ETH_NCFGR_IRXER_Pos)               /* (ETH_NCFGR) Ignore IPG GRXER Mask */
#define ETH_NCFGR_IRXER(value)                (ETH_NCFGR_IRXER_Msk & (_UINT32_(value) << ETH_NCFGR_IRXER_Pos)) /* Assignment of value for IRXER in the ETH_NCFGR register */
#define ETH_NCFGR_UNI_Pos                     _UINT32_(31)                                         /* (ETH_NCFGR) Uni-Direction Enable Position */
#define ETH_NCFGR_UNI_Msk                     (_UINT32_(0x1) << ETH_NCFGR_UNI_Pos)                 /* (ETH_NCFGR) Uni-Direction Enable Mask */
#define ETH_NCFGR_UNI(value)                  (ETH_NCFGR_UNI_Msk & (_UINT32_(value) << ETH_NCFGR_UNI_Pos)) /* Assignment of value for UNI in the ETH_NCFGR register */
#define ETH_NCFGR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_NCFGR) Register Mask  */


/* -------- ETH_NSR : (ETH Offset: 0x1008) ( R/ 32) Network Status Register -------- */
#define ETH_NSR_RESETVALUE                    _UINT32_(0x04)                                       /*  (ETH_NSR) Network Status Register  Reset Value */

