MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz2051ca9/thirdparty/pic32cz2051ca9/component/eth.h
/* -------- ETH_TISUBN : (ETH Offset: 0x11BC) (R/W 32) 1588 Timer Increment [15:0] Sub-Nanoseconds Register -------- */
#define ETH_TISUBN_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TISUBN) 1588 Timer Increment [15:0] Sub-Nanoseconds Register  Reset Value */

#define ETH_TISUBN_MSBTIR_Pos                 _UINT32_(0)                                          /* (ETH_TISUBN) MSB [23:8] of Timer Increment sub-ns value Position */
#define ETH_TISUBN_MSBTIR_Msk                 (_UINT32_(0xFFFF) << ETH_TISUBN_MSBTIR_Pos)          /* (ETH_TISUBN) MSB [23:8] of Timer Increment sub-ns value Mask */
#define ETH_TISUBN_MSBTIR(value)              (ETH_TISUBN_MSBTIR_Msk & (_UINT32_(value) << ETH_TISUBN_MSBTIR_Pos)) /* Assignment of value for MSBTIR in the ETH_TISUBN register */
#define ETH_TISUBN_LSBTIR_Pos                 _UINT32_(24)                                         /* (ETH_TISUBN) LSB [7:0] of Timer Increment sub-ns value Position */
#define ETH_TISUBN_LSBTIR_Msk                 (_UINT32_(0xFF) << ETH_TISUBN_LSBTIR_Pos)            /* (ETH_TISUBN) LSB [7:0] of Timer Increment sub-ns value Mask */
#define ETH_TISUBN_LSBTIR(value)              (ETH_TISUBN_LSBTIR_Msk & (_UINT32_(value) << ETH_TISUBN_LSBTIR_Pos)) /* Assignment of value for LSBTIR in the ETH_TISUBN register */
#define ETH_TISUBN_Msk                        _UINT32_(0xFF00FFFF)                                 /* (ETH_TISUBN) Register Mask  */


/* -------- ETH_TSH : (ETH Offset: 0x11C0) (R/W 32) 1588 Timer Seconds Register 47:32 -------- */
#define ETH_TSH_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSH) 1588 Timer Seconds Register 47:32  Reset Value */

#define ETH_TSH_TMR_Pos                       _UINT32_(0)                                          /* (ETH_TSH) Timer Value MSB [47:32] Position */
#define ETH_TSH_TMR_Msk                       (_UINT32_(0xFFFF) << ETH_TSH_TMR_Pos)                /* (ETH_TSH) Timer Value MSB [47:32] Mask */
#define ETH_TSH_TMR(value)                    (ETH_TSH_TMR_Msk & (_UINT32_(value) << ETH_TSH_TMR_Pos)) /* Assignment of value for TMR in the ETH_TSH register */
#define ETH_TSH_Msk                           _UINT32_(0x0000FFFF)                                 /* (ETH_TSH) Register Mask  */


/* -------- ETH_TSSSH : (ETH Offset: 0x11C4) ( R/ 32) 1588 Timer Sync Strobe Seconds Register 47:32 -------- */
#define ETH_TSSSH_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_TSSSH) 1588 Timer Sync Strobe Seconds Register 47:32  Reset Value */

#define ETH_TSSSH_VTS_Pos                     _UINT32_(0)                                          /* (ETH_TSSSH) 1588 Timer Sync Strobe Seconds Position */
#define ETH_TSSSH_VTS_Msk                     (_UINT32_(0xFFFF) << ETH_TSSSH_VTS_Pos)              /* (ETH_TSSSH) 1588 Timer Sync Strobe Seconds Mask */
#define ETH_TSSSH_VTS(value)                  (ETH_TSSSH_VTS_Msk & (_UINT32_(value) << ETH_TSSSH_VTS_Pos)) /* Assignment of value for VTS in the ETH_TSSSH register */
#define ETH_TSSSH_Msk                         _UINT32_(0x0000FFFF)                                 /* (ETH_TSSSH) Register Mask  */


/* -------- ETH_TSSSL : (ETH Offset: 0x11C8) ( R/ 32) 1588 Timer Sync Strobe Seconds [31:0] Register -------- */
#define ETH_TSSSL_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_TSSSL) 1588 Timer Sync Strobe Seconds [31:0] Register  Reset Value */

#define ETH_TSSSL_VTS_Pos                     _UINT32_(0)                                          /* (ETH_TSSSL) Value of Timer Seconds Register Capture Position */
#define ETH_TSSSL_VTS_Msk                     (_UINT32_(0xFFFFFFFF) << ETH_TSSSL_VTS_Pos)          /* (ETH_TSSSL) Value of Timer Seconds Register Capture Mask */
#define ETH_TSSSL_VTS(value)                  (ETH_TSSSL_VTS_Msk & (_UINT32_(value) << ETH_TSSSL_VTS_Pos)) /* Assignment of value for VTS in the ETH_TSSSL register */
#define ETH_TSSSL_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (ETH_TSSSL) Register Mask  */


/* -------- ETH_TSSN : (ETH Offset: 0x11CC) ( R/ 32) 1588 Timer Sync Strobe Nanoseconds Register -------- */
#define ETH_TSSN_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_TSSN) 1588 Timer Sync Strobe Nanoseconds Register  Reset Value */

#define ETH_TSSN_VTN_Pos                      _UINT32_(0)                                          /* (ETH_TSSN) Value Timer Nanoseconds Register Capture Position */
#define ETH_TSSN_VTN_Msk                      (_UINT32_(0x3FFFFFFF) << ETH_TSSN_VTN_Pos)           /* (ETH_TSSN) Value Timer Nanoseconds Register Capture Mask */
#define ETH_TSSN_VTN(value)                   (ETH_TSSN_VTN_Msk & (_UINT32_(value) << ETH_TSSN_VTN_Pos)) /* Assignment of value for VTN in the ETH_TSSN register */
#define ETH_TSSN_Msk                          _UINT32_(0x3FFFFFFF)                                 /* (ETH_TSSN) Register Mask  */


/* -------- ETH_TSL : (ETH Offset: 0x11D0) (R/W 32) 1588 Timer Seconds [31:0] Register -------- */
#define ETH_TSL_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TSL) 1588 Timer Seconds [31:0] Register  Reset Value */

#define ETH_TSL_TCS_Pos                       _UINT32_(0)                                          /* (ETH_TSL) Timer Count in Seconds Position */
#define ETH_TSL_TCS_Msk                       (_UINT32_(0xFFFFFFFF) << ETH_TSL_TCS_Pos)            /* (ETH_TSL) Timer Count in Seconds Mask */
#define ETH_TSL_TCS(value)                    (ETH_TSL_TCS_Msk & (_UINT32_(value) << ETH_TSL_TCS_Pos)) /* Assignment of value for TCS in the ETH_TSL register */
#define ETH_TSL_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_TSL) Register Mask  */


/* -------- ETH_TN : (ETH Offset: 0x11D4) (R/W 32) 1588 Timer Nanoseconds Register -------- */
#define ETH_TN_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_TN) 1588 Timer Nanoseconds Register  Reset Value */

