MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz2051ca9/thirdparty/pic32cz2051ca9/component/eth.h
/* -------- ETH_RXBDCTRL : (ETH Offset: 0x14D0) (R/W 32) RX BD control register -------- */
#define ETH_RXBDCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_RXBDCTRL) RX BD control register  Reset Value */

#define ETH_RXBDCTRL_RXBDTSM_Pos              _UINT32_(4)                                          /* (ETH_RXBDCTRL) RX Descriptor Timestamp Insertion mode Position */
#define ETH_RXBDCTRL_RXBDTSM_Msk              (_UINT32_(0x3) << ETH_RXBDCTRL_RXBDTSM_Pos)          /* (ETH_RXBDCTRL) RX Descriptor Timestamp Insertion mode Mask */
#define ETH_RXBDCTRL_RXBDTSM(value)           (ETH_RXBDCTRL_RXBDTSM_Msk & (_UINT32_(value) << ETH_RXBDCTRL_RXBDTSM_Pos)) /* Assignment of value for RXBDTSM in the ETH_RXBDCTRL register */
#define ETH_RXBDCTRL_Msk                      _UINT32_(0x00000030)                                 /* (ETH_RXBDCTRL) Register Mask  */


/* -------- ETH_URXQBA : (ETH Offset: 0x14D4) (R/W 32) Upper 32 bits of receive buffer descriptor queue base address -------- */
#define ETH_URXQBA_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_URXQBA) Upper 32 bits of receive buffer descriptor queue base address  Reset Value */

#define ETH_URXQBA_URXQBA_Pos                 _UINT32_(0)                                          /* (ETH_URXQBA) Upper 32 bits of receive buffer descriptor queue base address Position */
#define ETH_URXQBA_URXQBA_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_URXQBA_URXQBA_Pos)      /* (ETH_URXQBA) Upper 32 bits of receive buffer descriptor queue base address Mask */
#define ETH_URXQBA_URXQBA(value)              (ETH_URXQBA_URXQBA_Msk & (_UINT32_(value) << ETH_URXQBA_URXQBA_Pos)) /* Assignment of value for URXQBA in the ETH_URXQBA register */
#define ETH_URXQBA_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_URXQBA) Register Mask  */


/* -------- ETH_SCRT1 : (ETH Offset: 0x1500) (R/W 32) Screening Type 1 Register N -------- */
#define ETH_SCRT1_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SCRT1) Screening Type 1 Register N  Reset Value */

#define ETH_SCRT1_QNMBR_Pos                   _UINT32_(0)                                          /* (ETH_SCRT1) Queue Number Position */
#define ETH_SCRT1_QNMBR_Msk                   (_UINT32_(0xF) << ETH_SCRT1_QNMBR_Pos)               /* (ETH_SCRT1) Queue Number Mask */
#define ETH_SCRT1_QNMBR(value)                (ETH_SCRT1_QNMBR_Msk & (_UINT32_(value) << ETH_SCRT1_QNMBR_Pos)) /* Assignment of value for QNMBR in the ETH_SCRT1 register */
#define ETH_SCRT1_DSTCM_Pos                   _UINT32_(4)                                          /* (ETH_SCRT1) DS/TC Match Position */
#define ETH_SCRT1_DSTCM_Msk                   (_UINT32_(0xFF) << ETH_SCRT1_DSTCM_Pos)              /* (ETH_SCRT1) DS/TC Match Mask */
#define ETH_SCRT1_DSTCM(value)                (ETH_SCRT1_DSTCM_Msk & (_UINT32_(value) << ETH_SCRT1_DSTCM_Pos)) /* Assignment of value for DSTCM in the ETH_SCRT1 register */
#define ETH_SCRT1_UDPP_Pos                    _UINT32_(12)                                         /* (ETH_SCRT1) UDP Port Match Position */
#define ETH_SCRT1_UDPP_Msk                    (_UINT32_(0xFFFF) << ETH_SCRT1_UDPP_Pos)             /* (ETH_SCRT1) UDP Port Match Mask */
#define ETH_SCRT1_UDPP(value)                 (ETH_SCRT1_UDPP_Msk & (_UINT32_(value) << ETH_SCRT1_UDPP_Pos)) /* Assignment of value for UDPP in the ETH_SCRT1 register */
#define ETH_SCRT1_DSTCE_Pos                   _UINT32_(28)                                         /* (ETH_SCRT1) DS/TC Enable Position */
#define ETH_SCRT1_DSTCE_Msk                   (_UINT32_(0x1) << ETH_SCRT1_DSTCE_Pos)               /* (ETH_SCRT1) DS/TC Enable Mask */
#define ETH_SCRT1_DSTCE(value)                (ETH_SCRT1_DSTCE_Msk & (_UINT32_(value) << ETH_SCRT1_DSTCE_Pos)) /* Assignment of value for DSTCE in the ETH_SCRT1 register */
#define ETH_SCRT1_UDPE_Pos                    _UINT32_(29)                                         /* (ETH_SCRT1) UDP Port Match Enable Position */
#define ETH_SCRT1_UDPE_Msk                    (_UINT32_(0x1) << ETH_SCRT1_UDPE_Pos)                /* (ETH_SCRT1) UDP Port Match Enable Mask */
#define ETH_SCRT1_UDPE(value)                 (ETH_SCRT1_UDPE_Msk & (_UINT32_(value) << ETH_SCRT1_UDPE_Pos)) /* Assignment of value for UDPE in the ETH_SCRT1 register */
#define ETH_SCRT1_Msk                         _UINT32_(0x3FFFFFFF)                                 /* (ETH_SCRT1) Register Mask  */


/* -------- ETH_SCRT2 : (ETH Offset: 0x1540) (R/W 32) Screening Type 2 Register -------- */
#define ETH_SCRT2_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_SCRT2) Screening Type 2 Register  Reset Value */

#define ETH_SCRT2_QNMBR_Pos                   _UINT32_(0)                                          /* (ETH_SCRT2) Queue Number Position */
#define ETH_SCRT2_QNMBR_Msk                   (_UINT32_(0xF) << ETH_SCRT2_QNMBR_Pos)               /* (ETH_SCRT2) Queue Number Mask */
#define ETH_SCRT2_QNMBR(value)                (ETH_SCRT2_QNMBR_Msk & (_UINT32_(value) << ETH_SCRT2_QNMBR_Pos)) /* Assignment of value for QNMBR in the ETH_SCRT2 register */
#define ETH_SCRT2_VLANPRI_Pos                 _UINT32_(4)                                          /* (ETH_SCRT2) VLAN Priority Position */
#define ETH_SCRT2_VLANPRI_Msk                 (_UINT32_(0x7) << ETH_SCRT2_VLANPRI_Pos)             /* (ETH_SCRT2) VLAN Priority Mask */
#define ETH_SCRT2_VLANPRI(value)              (ETH_SCRT2_VLANPRI_Msk & (_UINT32_(value) << ETH_SCRT2_VLANPRI_Pos)) /* Assignment of value for VLANPRI in the ETH_SCRT2 register */
#define ETH_SCRT2_VLANE_Pos                   _UINT32_(8)                                          /* (ETH_SCRT2) VLAN Enable Position */
#define ETH_SCRT2_VLANE_Msk                   (_UINT32_(0x1) << ETH_SCRT2_VLANE_Pos)               /* (ETH_SCRT2) VLAN Enable Mask */
#define ETH_SCRT2_VLANE(value)                (ETH_SCRT2_VLANE_Msk & (_UINT32_(value) << ETH_SCRT2_VLANE_Pos)) /* Assignment of value for VLANE in the ETH_SCRT2 register */
#define ETH_SCRT2_ETID_Pos                    _UINT32_(9)                                          /* (ETH_SCRT2) EtherType Index Position */
#define ETH_SCRT2_ETID_Msk                    (_UINT32_(0x7) << ETH_SCRT2_ETID_Pos)                /* (ETH_SCRT2) EtherType Index Mask */
#define ETH_SCRT2_ETID(value)                 (ETH_SCRT2_ETID_Msk & (_UINT32_(value) << ETH_SCRT2_ETID_Pos)) /* Assignment of value for ETID in the ETH_SCRT2 register */
#define ETH_SCRT2_ETE_Pos                     _UINT32_(12)                                         /* (ETH_SCRT2) EtherType Enable Position */
#define ETH_SCRT2_ETE_Msk                     (_UINT32_(0x1) << ETH_SCRT2_ETE_Pos)                 /* (ETH_SCRT2) EtherType Enable Mask */
#define ETH_SCRT2_ETE(value)                  (ETH_SCRT2_ETE_Msk & (_UINT32_(value) << ETH_SCRT2_ETE_Pos)) /* Assignment of value for ETE in the ETH_SCRT2 register */
#define ETH_SCRT2_CMPAID_Pos                  _UINT32_(13)                                         /* (ETH_SCRT2) Compare A Index Position */
#define ETH_SCRT2_CMPAID_Msk                  (_UINT32_(0x1F) << ETH_SCRT2_CMPAID_Pos)             /* (ETH_SCRT2) Compare A Index Mask */
#define ETH_SCRT2_CMPAID(value)               (ETH_SCRT2_CMPAID_Msk & (_UINT32_(value) << ETH_SCRT2_CMPAID_Pos)) /* Assignment of value for CMPAID in the ETH_SCRT2 register */
#define ETH_SCRT2_CMPAE_Pos                   _UINT32_(18)                                         /* (ETH_SCRT2) Compare A Enable Position */
#define ETH_SCRT2_CMPAE_Msk                   (_UINT32_(0x1) << ETH_SCRT2_CMPAE_Pos)               /* (ETH_SCRT2) Compare A Enable Mask */
#define ETH_SCRT2_CMPAE(value)                (ETH_SCRT2_CMPAE_Msk & (_UINT32_(value) << ETH_SCRT2_CMPAE_Pos)) /* Assignment of value for CMPAE in the ETH_SCRT2 register */
#define ETH_SCRT2_CMPBID_Pos                  _UINT32_(19)                                         /* (ETH_SCRT2) Compare B Index Position */
#define ETH_SCRT2_CMPBID_Msk                  (_UINT32_(0x1F) << ETH_SCRT2_CMPBID_Pos)             /* (ETH_SCRT2) Compare B Index Mask */
#define ETH_SCRT2_CMPBID(value)               (ETH_SCRT2_CMPBID_Msk & (_UINT32_(value) << ETH_SCRT2_CMPBID_Pos)) /* Assignment of value for CMPBID in the ETH_SCRT2 register */
#define ETH_SCRT2_CMPBE_Pos                   _UINT32_(24)                                         /* (ETH_SCRT2) Compare B Enable Position */
#define ETH_SCRT2_CMPBE_Msk                   (_UINT32_(0x1) << ETH_SCRT2_CMPBE_Pos)               /* (ETH_SCRT2) Compare B Enable Mask */
#define ETH_SCRT2_CMPBE(value)                (ETH_SCRT2_CMPBE_Msk & (_UINT32_(value) << ETH_SCRT2_CMPBE_Pos)) /* Assignment of value for CMPBE in the ETH_SCRT2 register */
#define ETH_SCRT2_CMPCID_Pos                  _UINT32_(25)                                         /* (ETH_SCRT2) Compare C Index Position */
#define ETH_SCRT2_CMPCID_Msk                  (_UINT32_(0x1F) << ETH_SCRT2_CMPCID_Pos)             /* (ETH_SCRT2) Compare C Index Mask */
#define ETH_SCRT2_CMPCID(value)               (ETH_SCRT2_CMPCID_Msk & (_UINT32_(value) << ETH_SCRT2_CMPCID_Pos)) /* Assignment of value for CMPCID in the ETH_SCRT2 register */
#define ETH_SCRT2_CMPCE_Pos                   _UINT32_(30)                                         /* (ETH_SCRT2) Compare C Enable Position */
#define ETH_SCRT2_CMPCE_Msk                   (_UINT32_(0x1) << ETH_SCRT2_CMPCE_Pos)               /* (ETH_SCRT2) Compare C Enable Mask */
#define ETH_SCRT2_CMPCE(value)                (ETH_SCRT2_CMPCE_Msk & (_UINT32_(value) << ETH_SCRT2_CMPCE_Pos)) /* Assignment of value for CMPCE in the ETH_SCRT2 register */
#define ETH_SCRT2_Msk                         _UINT32_(0x7FFFFF7F)                                 /* (ETH_SCRT2) Register Mask  */


/* -------- ETH_RXQPTR : (ETH Offset: 0x15C0) (R/W 32) Receive buffer queue base address -------- */
#define ETH_RXQPTR_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_RXQPTR) Receive buffer queue base address  Reset Value */

